In [1]:
import pandas as pd

In [2]:
price_table = pd.read_csv('/Users/adriaferrer/Avocalypse_data/FAOSTAT_pricing.csv')

In [3]:
price_table.shape

(527, 14)

In [4]:
price_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 527 entries, 0 to 526
Data columns (total 14 columns):
Domain Code         527 non-null object
Domain              527 non-null object
Area Code           527 non-null int64
Area                527 non-null object
Element Code        527 non-null int64
Element             527 non-null object
Item Code           527 non-null int64
Item                527 non-null object
Year Code           527 non-null int64
Year                527 non-null int64
Unit                0 non-null float64
Value               527 non-null float64
Flag                527 non-null object
Flag Description    527 non-null object
dtypes: float64(2), int64(5), object(7)
memory usage: 57.7+ KB

In [5]:
price_table.head()

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,PI,Producer Price Indices - Annual,9,Argentina,5539,Producer Price Index (2004-2006 = 100),572,Avocados,2007,2007,NaN,123.086061,Fc,Calculated data
1,PI,Producer Price Indices - Annual,9,Argentina,5539,Producer Price Index (2004-2006 = 100),572,Avocados,2008,2008,NaN,155.952012,Fc,Calculated data
2,PI,Producer Price Indices - Annual,9,Argentina,5539,Producer Price Index (2004-2006 = 100),572,Avocados,2009,2009,NaN,139.891744,Fc,Calculated data
3,PI,Producer Price Indices - Annual,9,Argentina,5539,Producer Price Index (2004-2006 = 100),572,Avocados,2010,2010,NaN,171.921928,Fc,Calculated data
4,PI,Producer Price Indices - Annual,9,Argentina,5539,Producer Price Index (2004-2006 = 100),572,Avocados,2011,2011,NaN,215.123273,Fc,Calculated data

In [6]:
price_table.isna().sum()

Domain Code           0
Domain                0
Area Code             0
Area                  0
Element Code          0
Element               0
Item Code             0
Item                  0
Year Code             0
Year                  0
Unit                527
Value                 0
Flag                  0
Flag Description      0
dtype: int64

In [16]:
price_table = price_table[['Area Code','Year Code','Value']]

In [17]:
price_table.head()

   Area Code  Year Code       Value
0          9       2007  123.086061
1          9       2008  155.952012
2          9       2009  139.891744
3          9       2010  171.921928
4          9       2011  215.123273

In [11]:
from sqlalchemy import create_engine

driver = 'mysql+pymysql:'
user = 'root'
password = '17028854'
ip = '35.195.111.11'
database = 'Avocalypse'

connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
engine = create_engine(connection_string)

In [19]:
price_table.to_sql('prices',con=engine, if_exists='replace')